apps/load-test/artillery/dev-test.yaml
config:
  target: http://223.130.140.152:3000
  phases:
    - duration: 60           # 60초 동안 테스트
      arrivalRate: 1         # 초당 1명씩 입장 (총 ~60명)
  processor: ../load-test-processor.js

scenarios:
  - name: "강의실 입장 테스트"
    flow:
      - function: "ensureRoom"           # 1. 강의실 생성/재사용
      - function: "joinAsParticipant"    # 2. 참가자 HTTP 등록
      - function: "connectAndJoinRoom"   # 3. Socket.IO 연결 + join_room
      - function: "maintainConnection"   # 4. 5초 대기
      - function: "disconnectSocket"     # 5. 연결 종료